Python 3.11.5 (tags/v3.11.5:cce6ba9, Aug 24 2023, 14:38:34) [MSC v.1936 64 bit (AMD64)] on win32
Type "help", "copyright", "credits" or "license()" for more information.

= RESTART: C:/Users/Николай/AppData/Local/Programs/Python/Python311/sdfghjk.py
______________________________________________________
Компания KeyWee Production представляет..
Дом.
______________________________________________________
Пометка* Ввод оформляется английскими буквами. 
______________________________________________________
Предыстория...
Вы гуляли по лесу и вдруг увидели одиноко стоящий дом.
Вы решили подойти к двери.
Нажмите W чтобы открыть дверь
Нажмите E чтобы не открывать дверь.
ц
Нажмите на 'E' или 'W'.
W
Вы открыли дверь и вошли внутрь, ваши действия?
Нажмите W чтобы подняться на 2 этаж
Нажмите E чтобы остаться на 1 этаже
W
Наверху стоял стол. На нем были 3 вещи.
Нажмите на 1 чтобы взять предмет 'Меч' 
Нажмите на 2 чтобы взять предмет 'Книга'
Нажмите на 3 чтобы взять предмет 'Ключ'
Нажмите на 4 чтобы не брать предметы
2
Вы подняли предмет 2.
Внизу вы поняли что дверь оказалась закрытой, а на ней висела записка:
Я надеюсь ты не взял ничего моего..
Вы сказали что ничего не брали, но двери не отворились.
Вы поняли что надо бежать.
Вы увидели в углу старый топор и решили выбить им дверь.
Нажмите 'B' чтобы ударить.

= RESTART: C:/Users/Николай/AppData/Local/Programs/Python/Python311/sdfghjk.py =
______________________________________________________
Компания KeyWee Production представляет..
Дом.
______________________________________________________
Пометка* Ввод оформляется английскими буквами. 
______________________________________________________
Предыстория...
Вы гуляли по лесу и вдруг увидели одиноко стоящий дом.
Вы решили подойти к двери.
Нажмите W чтобы открыть дверь
Нажмите E чтобы не открывать дверь.
w
Нажмите на 'E' или 'W'.
W
Вы открыли дверь и вошли внутрь, ваши действия?
Нажмите W чтобы подняться на 2 этаж
Нажмите E чтобы остаться на 1 этаже
W
Наверху стоял стол. На нем были 3 вещи.
Нажмите на 1 чтобы взять предмет 'Меч' 
Нажмите на 2 чтобы взять предмет 'Книга'
Нажмите на 3 чтобы взять предмет 'Ключ'
Нажмите на 4 чтобы не брать предметы
3
Вы подняли предмет 'Ключ'.
Внизу вы поняли что дверь оказалась закрытой, а на ней висела записка:
Я надеюсь ты не взял ничего моего..
Вы сказали что ничего не брали, но двери не отворились.
Вы поняли что надо бежать.
Вы увидели в углу старый топор и решили выбить им дверь.
Нажмите 'B' чтобы ударить.
B
Бей!
B
Бей!
B
Бей!
B
Деревянное покрытие двери слетело и она оказалась металлической.
Вы поняли что долбить ее бессмысленно.
'Точно, Окно!' Вы побежали к окну, но окна закрылись огромными ставнями.
'Что же делать?'
Нажмите W чтобы подняться наверх.
W
Вы поднялись навверх.
Нажмите на L если хотите зайти в комнату со столом.
Нажмите на N если хотите зайти в другую комнату.
N
'Дверь закрыта и кажется нужен ключ, зайду-ка я в комнату со столом.'
Нажмите на L если хотите зайти в комнату со столом.

====================================== RESTART: C:/Users/Николай/AppData/Local/Programs/Python/Python311/sdfghjk.py =====================================
______________________________________________________
Компания KeyWee Production представляет..
Дом.
______________________________________________________
Пометка* Ввод оформляется английскими буквами. 
______________________________________________________
Предыстория...
Вы гуляли по лесу и вдруг увидели одиноко стоящий дом.
Вы решили подойти к двери.
Нажмите W чтобы открыть дверь
Нажмите E чтобы не открывать дверь.
W
Вы открыли дверь и вошли внутрь, ваши действия?
Нажмите W чтобы подняться на 2 этаж
Нажмите E чтобы остаться на 1 этаже
W
Наверху стоял стол. На нем были 3 вещи.
Нажмите на 1 чтобы взять предмет 'Меч' 
Нажмите на 2 чтобы взять предмет 'Книга'
Нажмите на 3 чтобы взять предмет '???'
Нажмите на 4 чтобы не брать предметы
3
Вы подняли предмет '???'.
Внизу вы поняли что дверь оказалась закрытой, а на ней висела записка:
Я надеюсь ты не взял ничего моего..
Вы сказали что ничего не брали, но двери не отворились.
Вы поняли что надо бежать.
Вы увидели в углу старый топор и решили выбить им дверь.
Нажмите 'B' чтобы ударить.
B
Бей!
B
Бей!
B
Бей!
B
Деревянное покрытие двери слетело и она оказалась металлической.
Вы поняли что долбить ее бессмысленно.
'Точно, Окно!' Вы побежали к окну, но окна закрылись огромными ставнями.
'Что же делать?'
Нажмите W чтобы подняться наверх.
W
Вы поднялись навверх.
Нажмите на L если хотите зайти в комнату со столом.
Нажмите на N если хотите зайти в другую комнату.
N
'Дверь закрыта и кажется нужен ключ, зайду-ка я в комнату со столом.'
Нажмите на L если хотите зайти в комнату со столом.
L
Вы зашли в комнату со столом. На нем осталось лежать 2 вещи.
Нажмите на E чтобы забрать оставшиеся вещи.
E
Вы забрали все вещи со стола и вышли из комнаты.
'Какая-то интересная комната. Надо зайти.'
Нажмите на N чтобы войти в комнату.
N
'Эта дверь закрыта, попробую вставить ключ со стола.'
Вы вставляете ключ в отверстие..
Нажмите на 'R' чтобы провернуть ключ.
Крути!
R
Крути!
R
Крути!
R
Дверь открылась, а там..
Нажмите на 'C' чтобы продолжить.
Continue...

====================================== RESTART: C:/Users/Николай/AppData/Local/Programs/Python/Python311/sdfghjk.py =====================================
______________________________________________________
Компания KeyWee Production представляет..
Дом.
______________________________________________________
Пометка* Ввод оформляется английскими буквами. 
______________________________________________________
Предыстория...
Вы гуляли по лесу и вдруг увидели одиноко стоящий дом.
Вы решили подойти к двери.
Нажмите W чтобы открыть дверь
Нажмите E чтобы не открывать дверь.
W
Вы открыли дверь и вошли внутрь, ваши действия?
Нажмите W чтобы подняться на 2 этаж
Нажмите E чтобы остаться на 1 этаже
W
Наверху стоял стол. На нем были 3 вещи.
Нажмите на 1 чтобы взять предмет 'Меч' 
Нажмите на 2 чтобы взять предмет 'Книга'
Нажмите на 3 чтобы взять предмет '???'
Нажмите на 4 чтобы не брать предметы
1
Вы подняли предмет 'Меч'.
Внизу вы поняли что дверь оказалась закрытой, а на ней висела записка:
Я надеюсь ты не взял ничего моего..
Вы сказали что ничего не брали, но двери не отворились.
Вы поняли что надо бежать.
Вы увидели в углу старый топор и решили выбить им дверь.
Нажмите 'B' чтобы ударить.
B
Бей!
B
Бей!
B
Бей!
B
Деревянное покрытие двери слетело и она оказалась металлической.
Вы поняли что долбить ее бессмысленно.
'Точно, Окно!' Вы побежали к окну, но окна закрылись огромными ставнями.
'Что же делать?'
Нажмите W чтобы подняться наверх.
W
Вы поднялись навверх.
Нажмите на L если хотите зайти в комнату со столом.
Нажмите на N если хотите зайти в другую комнату.
N
'Дверь закрыта и кажется нужен ключ, зайду-ка я в комнату со столом.'
Нажмите на L если хотите зайти в комнату со столом.
L
Вы зашли в комнату со столом. На нем осталось лежать 2 вещи.
Нажмите на E чтобы забрать оставшиеся вещи.
Вы нашли в ящике ключ.

====================================== RESTART: C:/Users/Николай/AppData/Local/Programs/Python/Python311/sdfghjk.py =====================================
______________________________________________________
Компания KeyWee Production представляет..
Дом.
______________________________________________________
Пометка* Ввод оформляется английскими буквами. 
______________________________________________________
Предыстория...
Вы гуляли по лесу и вдруг увидели одиноко стоящий дом.
Вы решили подойти к двери.
Нажмите W чтобы открыть дверь
Нажмите E чтобы не открывать дверь.
W
Вы открыли дверь и вошли внутрь, ваши действия?
Нажмите W чтобы подняться на 2 этаж
Нажмите E чтобы остаться на 1 этаже
W
Наверху стоял стол. На нем были 3 вещи.
Нажмите на 1 чтобы взять предмет 'Меч' 
Нажмите на 2 чтобы взять предмет 'Книга'
Нажмите на 3 чтобы взять предмет '???'
Нажмите на 4 чтобы не брать предметы
3
Вы подняли предмет '???'.
Внизу вы поняли что дверь оказалась закрытой, а на ней висела записка:
Я надеюсь ты не взял ничего моего..
Вы сказали что ничего не брали, но двери не отворились.
Вы поняли что надо бежать.
Вы увидели в углу старый топор и решили выбить им дверь.
Нажмите 'B' чтобы ударить.
B
Бей!
B
Бей!
B
Бей!
B
Деревянное покрытие двери слетело и она оказалась металлической.
Вы поняли что долбить ее бессмысленно.
'Точно, Окно!' Вы побежали к окну, но окна закрылись огромными ставнями.
'Что же делать?'
Нажмите W чтобы подняться наверх.
B
Нажмите на 'W'.
W
Вы поднялись навверх.
Нажмите на L если хотите зайти в комнату со столом.
Нажмите на N если хотите зайти в другую комнату.
N
'Дверь закрыта и кажется нужен ключ, зайду-ка я в комнату со столом.'
Нажмите на L если хотите зайти в комнату со столом.
L
Вы зашли в комнату со столом. На нем осталось лежать 2 вещи.
Вы нашли в ящике ключ.
Нажмите на E чтобы забрать оставшиеся вещи.
E
Вы забрали все вещи со стола и вышли из комнаты.
'Какая-то интересная комната. Надо зайти.'
Нажмите на N чтобы войти в комнату.
N
'Эта дверь закрыта, попробую вставить ключ со стола.'
Вы вставляете ключ в отверстие..
Нажмите на 'R' чтобы провернуть ключ.
Крути!
R
Крути!
R
Крути!
R
Дверь открылась, а там..
Нажмите на 'C' чтобы продолжить.
Continue...
R
Нажмите на 'C' чтобы продолжить.
C
Дверь открылась, а там был длинный черный коридор..
От ваших ног и прямо до конца коридора стали загораться огоньки.
Нажмите 'W' чтобы пройти вглубь коридора.
W
Вы не придумали ничего лучше чем пойти за ними.
Нажмите 'W' чтобы чтобы сделать шаг.
W
Шагай!
W
Шагай!
W
Шагай!
W
Вы шли по тёмному коридору и в какой-то момент потеряли сознание.
Очнулись вы в лесу и увидели одиноко стоящий дом.
Вы решили подойти к двери.
Нажмите W чтобы открыть дверь
Нажмите E чтобы не открывать дверь.
W
Вы открыли дверь и...
Продолжение во второй части.
